## 데이터 로드

In [1]:
import pandas as pd

naver_sm = pd.read_csv('../../../data/Naver/naver_sm.csv')

In [2]:
naver_sm.head()

       period    ratio title
0  2023-01-01  1.68370    SM
1  2023-01-02  2.39784    SM
2  2023-01-03  2.24258    SM
3  2023-01-04  2.51012    SM
4  2023-01-05  2.11987    SM

## period 변수 변환
- datetime 형식으로 변환 
- 변수명 'date'로 변경

In [3]:
# 변수명 변경
naver_sm.rename(columns={'period': 'date'}, inplace=True)

# 변수 형식 변경
naver_sm['date'] = pd.to_datetime(naver_sm['date'])
naver_sm.head() # 확인

        date    ratio title
0 2023-01-01  1.68370    SM
1 2023-01-02  2.39784    SM
2 2023-01-03  2.24258    SM
3 2023-01-04  2.51012    SM
4 2023-01-05  2.11987    SM

## title 변수에 따라 데이터프레임 분할

- 이 검색량 데이터의 그룹은 5개이다. 
- 'SM', 'AESPA', 'NCT', 'EXO', 'BOA'

In [4]:
naver_sm['title'].unique()

array(['SM', 'AESPA', 'NCT', 'EXO', 'BOA'], dtype=object)

In [5]:
df1 = naver_sm[naver_sm['title'] == 'SM']
df2 = naver_sm[naver_sm['title'] == 'AESPA']
df3 = naver_sm[naver_sm['title'] == 'NCT']
df4 = naver_sm[naver_sm['title'] == 'EXO']
df5 = naver_sm[naver_sm['title'] == 'BOA']

In [6]:
df1.head()

        date    ratio title
0 2023-01-01  1.68370    SM
1 2023-01-02  2.39784    SM
2 2023-01-03  2.24258    SM
3 2023-01-04  2.51012    SM
4 2023-01-05  2.11987    SM

In [7]:
df2.head()

          date    ratio  title
181 2023-01-01  6.65344  AESPA
182 2023-01-02  4.45844  AESPA
183 2023-01-03  4.34074  AESPA
184 2023-01-04  4.08113  AESPA
185 2023-01-05  4.23932  AESPA

In [8]:
# 인덱스를 0부터 시작하는 정수로 리셋
df1.reset_index(drop=True, inplace=True)
df2.reset_index(drop=True, inplace=True)
df3.reset_index(drop=True, inplace=True)
df4.reset_index(drop=True, inplace=True)
df5.reset_index(drop=True, inplace=True)

## 날짜별 검색량 총합 구하기

In [9]:
merged_df = pd.DataFrame()

In [10]:
merged_df['date'] = df1['date']

In [11]:
merged_df['ratio_sum'] = df1['ratio']+df2['ratio']+df3['ratio']+df4['ratio']+df5['ratio']

In [12]:
merged_df

          date  ratio_sum
0   2023-01-01   24.96469
1   2023-01-02   15.04776
2   2023-01-03   14.15332
3   2023-01-04   14.04271
4   2023-01-05   13.70464
..         ...        ...
176 2023-06-26   16.99526
177 2023-06-27   14.64082
178 2023-06-28   15.29111
179 2023-06-29   15.00185
180 2023-06-30   16.08035

[181 rows x 2 columns]

In [13]:
# csv 파일로 저장 
merged_df.to_csv('../../../data/Naver/naver_preprocessed_sm.csv',index = False)